In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {"company":["goog","goog","msft","msft","fb","fb"],
        "person": ["sam","charlie","amy","venessa","carl","sarah"],
        "sales":[200,120,340,124,243,350]}

In [3]:
data

{'company': ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
 'person': ['sam', 'charlie', 'amy', 'venessa', 'carl', 'sarah'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  venessa    124
4      fb     carl    243
5      fb    sarah    350

In [7]:
byComp = df.groupby("company")

In [8]:
byComp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [9]:
byComp.sum()

         sales
company
fb         593
goog       320
msft       464

In [10]:
byComp.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [11]:
byComp.sum()

         sales
company
fb         593
goog       320
msft       464

In [12]:
print(byComp.sum().loc['fb'])

sales    593
Name: fb, dtype: int64

In [14]:
print(byComp.sum().loc['fb'])

sales    593
Name: fb, dtype: int64

In [15]:
print("hello")

hello

In [17]:
print(byComp.sum())

         sales
company
fb         593
goog       320
msft       464

In [18]:
df.groupby("company").sum().loc["fb"] # all in one line

sales    593
Name: fb, dtype: int64

In [19]:
byComp.count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [20]:
byComp.max()

          person  sales
company
fb         sarah    350
goog         sam    200
msft     venessa    340

In [21]:
byComp.min()

          person  sales
company
fb          carl    243
goog     charlie    120
msft         amy    124

In [26]:
df.groupby("company").describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64